Tekla.Structures.Model.RebarLegSurfaceObject
The RebarLegSurfaceObject class represents a polymesh surface for generating rebar legs in a Tekla.Structures.Model.RebarLegSurfaceObject.RebarSet.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1(Vector[] vertices, int[][] outerWires, IDictionary<int, int[][]> innerWires)
{
var beam = new Beam();
// Set Beam properties (code omitted)...
beam.Insert();
var rebarSet = new RebarSet();
// Set RebarSet properties (code omitted)...
rebarSet.Insert();
var legSurface = new RebarLegSurfaceObject();
legSurface.Polymesh = new FacetedBrep(vertices, outerWires, innerWires);
legSurface.Father = beam;
legSurface.RebarSet = rebarSet;
legSurface.LayerNumber = 1;
legSurface.AdditionalOffset = 25.0;
legSurface.Insert();
}
}

Tekla.Structures.Model.RebarLegSurfaceObject.AdditionalOffset
Gets or sets the user defined offset of the rebar legs from the leg surface object.